benchmarks/testTubeMixer/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory
rm log.* 2> /dev/null
rm -r 0.* [1-9]*

# Source tutorial run functions
. /opt/openfoam7/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
